GATTox21(
  (node_embedding): Linear(in_features=9, out_features=64, bias=True)
  (convs): ModuleList(
    (0): GATv2Conv(64, 64, heads=8)
    (1-3): 3 x GATv2Conv(512, 64, heads=8)
  )
  (bn): ModuleList(
    (0-3): 4 x BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (fc): Linear(in_features=512, out_features=12, bias=True)
)