GATTox21(
  (node_embedding): Linear(in_features=9, out_features=128, bias=True)
  (convs): ModuleList(
    (0): GATv2Conv(128, 128, heads=4)
    (1-2): 2 x GATv2Conv(512, 128, heads=4)
  )
  (bn): ModuleList(
    (0-2): 3 x BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (fc): Linear(in_features=512, out_features=12, bias=True)
)